app/controllers/comments_controller.rb

  def create
    @comment  = Comment.new(params[:comment])

    respond_to do |format|
      if @comment.save
---
INSERT INTO "comments" ("created_at", "author", "body", "updated_at", "post_id", "date", "email") VALUES('2009-09-16 22:28:16', 'abc', 'xcvxcvsdfvsdv', '2009-09-16 22:28:16', 1, NULL, 'abc')