app/controllers/posts_controller.rb

SELECT * FROM "posts" WHERE ("posts"."id" = 1)
SELECT * FROM "comments" WHERE ("comments"."post_id" = 1)
---
  def show
    @post = Post.find(params[:id])
    @comments = Comment.find(:all, :conditions => ["post_id=?",params[:id]])

INSERT INTO "posts" ("created_at", "title", "body", "updated_at") VALUES('2009-09-16 17:37:23', 'Post 1', 'Post 1', '2009-09-16 17:37:23')
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save

SELECT * FROM "posts" WHERE ("posts"."id" = 953125641)
---
  def update
    @post = Post.find(params[:id])